# 玩家初始状态
DECAY_PER_HOUR = {"hunger": 2, "thirst": 4, "fatigue": 3}
INVENTORY_SIZE = 100
MAX_HEALTH = {"hunger": 100, "thirst": 100, "fatigue": 100}
# 游戏内时间

COOK_MAP={
    "鱼":"烤鱼"
    
}
AGENTS = {}
PENDING = {}

PLAYER_INFO = {
    "player1": {
        "identity": "林墨墨(女,21)",
        "info": "你是一个画家,拥有杰出的绘画天赋。别人这样描述你：“她说自己在画风景，可熟悉的人都知道：她画的是没人敢说出口的心事。”",
        "skill": "作画(主动技能)：消耗8张纸以制作1副画作,耗时5分钟,使用技能的指令为{'type','painting'}。",
    },
    "player2": {
        "identity": "石老谋(男,57)",
        "info": "你是一个黑心商贩,你喜欢搅局，阻碍其它玩家成功，甚至，获胜不是你的第一目标，找乐子才是。用一句话描述你:“我最喜欢的不是赚钱，而是看着别人以为占了便宜时，那一瞬间短暂的愚蠢”",
        "skill": "口才(被动技能)：购买任何商品的价格降低5%。",
    },
    "player3": {
        "identity": "钟启恒(男,32)",
        "info": "你是一个富豪，你深谙赚钱的门道,你有能力和自信在短时间内赚取大量金钱。用一句话描述你:“别人起步靠天赋，我起步靠第一桶冷静；后来别人靠努力，我靠复利。”",
        "skill": "利滚利(被动技能)：每天0点，你可以获得当前资金20%的收益。",
    },
    "player4": {
        "identity": "江渔生(男,28)",
        "info": "你是一个钓鱼佬，你的钓鱼技术超群。用一句话描述你的性格：“我钓的不是鱼，是命运的秘密——只是没人知道哪一条会咬钩。”",
        "skill": "钓鱼：当前位置为湖边时可使用，且有20%获得双倍鱼,5%概率获得5倍鱼,0.6%概率获得传说鱼,获得传说鱼直接赢得比赛。"
    }
}
# 现实时间与游戏时间转化比例
TIME_RATIO = 120

WORLD_PLACE_MAP = {
    "河流":"钓鱼点",
    "森林":"采集点",
    "集市":"收银台",
    
}