# 玩家初始状态
DECAY_PER_HOUR = {"hunger": 2, "thirst": 4, "fatigue": 3}
INVENTORY_SIZE = 100
MAX_HEALTH = {"hunger": 100, "thirst": 100, "fatigue": 100}
# 游戏内时间

COOK_MAP={
    "鱼":"烤鱼"
    
}
AGENTS = {}
PENDING = {}

PLAYER_INFO = {
    "player1": {
        "identity": "林墨墨(女,21)",
        "info": "你是一个手艺人，你精通各种制作工艺。用一句话描述你:“世间万物皆可用心去做，细节决定成败。”",
        "skill": "工匠(被动技能):你开局自带鱼竿、斧头、猎枪、篮子且钓鱼不用消耗鱼饵、烹饪不需要额外付费。出售鱼类、浆果、肉类价格翻倍",
    },
    "player2": {
        "identity": "石老谋(男,57)",
        "info": "你是一个黑心商贩,你喜欢搅局，阻碍其它玩家成功，甚至，获胜不是你的第一目标，找乐子才是。用一句话描述你:“我最喜欢的不是赚钱，而是看着别人以为占了便宜时，那一瞬间短暂的愚蠢”",
        "skill": "口才(被动技能)：购买任何商品的价格降低50%。",
    },
    "player3": {
        "identity": "钟启恒(男,32)",
        "info": "你是一个富豪，你深谙赚钱的门道,你有能力和自信在短时间内赚取大量金钱。用一句话描述你:“别人起步靠天赋，我起步靠第一桶冷静；后来别人靠努力，我靠复利。”",
        "skill": "利滚利(被动技能)：每天0点，你可以获得当前资金20%的收益。",
    },
    "player4": {
        "identity": "江凡(男,28)",
        "info": "你是一个平民",
        "skill": "你没有任何技能，你只是一个平平无奇的NPC，但有着逆天改命的梦"
    }
}
# 现实时间与游戏时间转化比例
TIME_RATIO = 120

WORLD_PLACE_MAP = {
    "河流":"钓鱼点",
    "森林":"采集点",
    "集市":"收银台",
    
}
# 睡眠时的精神回复速度
SLEEP_RECOVER = 10